Revit 2027 API
BuiltInFailures.SteelElementsFailures.SteelElementInvisibleInCurrentLevelOfDetailWarn Property
 The created elements are only visible in Detail Level: Fine.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementInvisibleInCurrentLevelOfDetailWarn { get; }
Public Shared ReadOnly Property SteelElementInvisibleInCurrentLevelOfDetailWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementInvisibleInCurrentLevelOfDetailWarn {
	FailureDefinitionId^ get ();
}
static member SteelElementInvisibleInCurrentLevelOfDetailWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementsFailures Class
Autodesk.Revit.DB Namespace